{
  "hsk1_lessons": [
    {
      "lesson_id": "lesson_9",
      "lesson_title": "الدرس 9",
      "grammar_points": [
        {
          "grammar_id": "grammar_1_9_1",
          "grammar_title": "1.日期的表达 (1) (rìqī de biǎodá (1)) - التعبير عن التاريخ (1): الشهر، اليوم، يوم الأسبوع",
          "explanation": "<p>للتعبير عن التاريخ بالصينية، نتبع ترتيب \"من الأكبر إلى الأصغر\": الشهر أولاً، ثم اليوم، ثم يوم الأسبوع.</p><p>الشهر (月 yuè): الرقم + 月. مثال: يناير (一月 yī yuè)، سبتمبر (九月 jiǔ yuè).</p><p>اليوم (日 rì / 号 hào): الرقم + 日 (رسمي) أو 号 (شفهي). مثال: اليوم الأول (一号 yī hào)، اليوم الحادي والثلاثون (三十一号 sānshíyī hào).</p><p>يوم الأسبوع (星期 xīngqī): 星期 + الرقم (من 一 إلى 六 للأيام من الاثنين إلى السبت). الأحد هو 星期天 (xīngqītiān) أو 星期日 (xīngqīrì).</p>"
        },
        {
          "grammar_id": "grammar_1_9_2",
          "grammar_title": "2.名词谓语句 (míngcí wèiyǔjù) - الجمل التي يكون فيها الخبر اسمًا",
          "explanation": "<p>في هذا النوع من الجمل، يكون الخبر (predicate) عبارة عن اسم أو عبارة اسمية. هذه الجمل تُستخدم عادة للتعبير عن العمر، الوقت، التاريخ، وهكذا.</p><div class=\"note\"><strong>ملاحظة هامة:</strong> في هذه الحالة، لا نستخدم \"是\" (shì) عادةً، خاصة عند ذكر العمر أو الوقت. يكون الاسم أو العبارة الاسمية هي الخبر مباشرة.</div>"
        },
        {
          "grammar_id": "grammar_1_9_3",
          "grammar_title": "3.连动句 (1): 去 + 地方 + 做什么 (liándòngjù (1): qù + dìfang + zuò shénme) - جمل الفعل المتسلسل (1): يذهب إلى (مكان) لـ (فعل شيء)",
          "explanation": "<p>الجملة ذات الفعل المتسلسل تحتوي على فعلين أو أكثر، حيث يكون الفعل الثاني هو الغرض أو الهدف من الفعل الأول. في هذه القاعدة، الفعل الأول هو \"去\" (qù - يذهب)، متبوعًا بمكان، ثم الفعل الثاني الذي يوضح ماذا سيفعل هناك. يمكن أحيانًا حذف المكان إذا كان واضحًا من السياق.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_10",
      "lesson_title": "الدرس 10",
      "grammar_points": [
        {
          "grammar_id": "grammar_1_10_1",
          "grammar_title": "1.能愿动词“想” (néngyuàn dòngcí “xiǎng”) - الفعل المساعد \"想\" (الرغبة/التخطيط)",
          "explanation": "<p>الفعل المساعد \"想\" (xiǎng) يُستخدم قبل الفعل الرئيسي للتعبير عن رغبة أو نية أو خطة للقيام بشيء ما. يُترجم إلى \"يريد أن\" أو \"يفكر في أن\".</p>"
        },
        {
          "grammar_id": "grammar_1_10_2",
          "grammar_title": "2.疑问代词“多少” (yíwèn dàicí “duōshao”) - ضمير الاستفهام \"كم\" (للأعداد الكبيرة/السعر)",
          "explanation": "<p>ضمير الاستفهام \"多少\" (duōshao) يُستخدم للسؤال عن الكمية، وعادةً ما تكون الكمية المتوقعة أكثر من 10. يمكن حذف كلمة الكمية (measure word) التي تلي \"多少\". يُستخدم \"多少\" أيضًا بشكل شائع للسؤال عن السعر في التركيبة \"...多少钱?\" (...duōshao qián? - كم سعر...؟).</p><div class=\"note\"><strong>ملاحظة:</strong> \"几\" (jǐ) للأعداد الصغيرة (عادة أقل من 10)، و \"多少\" (duōshao) للأعداد الأكبر أو عندما لا تكون متأكدًا من الكمية، وكذلك للسؤال عن السعر.</div>"
        },
        {
          "grammar_id": "grammar_1_10_3",
          "grammar_title": "3.量词“个”、“口” (liàngcí “ge”, “kǒu”) - كلمتا الكمية \"个\" و \"口\"",
          "explanation": "<p>• “个” (ge): هي أكثر كلمات الكمية شيوعًا في الصينية. تُستخدم مع العديد من الأسماء التي ليس لها كلمة كمية خاصة بها.</p><p>• “口” (kǒu): تُستخدم ككلمة كمية خاصة عند عد أفراد الأسرة (عدد الأفواه التي يجب إطعامها).</p>"
        },
        {
          "grammar_id": "grammar_1_10_4",
          "grammar_title": "4.钱数的表达 (qiánshù de biǎodá) - التعبير عن المبالغ المالية",
          "explanation": "<p>الوحدة الأساسية للعملة الصينية (الرنمينبي) هي \"元\" (yuán). في اللغة المحكية، غالبًا ما يُستخدم \"块\" (kuài) بدلاً من \"元\".</p><div class=\"note\"><strong>ملاحظة إضافية:</strong> 1元 (yuán) = 10角 (jiǎo) أو 10毛 (máo). 1角 = 10分 (fēn). في الحياة اليومية، \"分\" نادر الاستخدام. \"块\" و \"毛\" هي الأكثر شيوعًا في الكلام.<br>مثال: 3.50元 = 三块五毛 (sān kuài wǔ máo) أو ببساطة 三块五 (sān kuài wǔ).</div>"
        }
      ]
    },
    {
      "lesson_id": "lesson_11",
      "lesson_title": "الدرس 11",
      "grammar_points": [
        {
          "grammar_id": "grammar_1_11_1",
          "grammar_title": "1.叹词“喂” (tàncí “wèi”) - كلمة التعجب \"喂\" (ألو/مرحبًا - في الهاتف)",
          "explanation": "<p>\"喂\" (wèi أو wéi) هي كلمة تعجب تُستخدم بشكل أساسي عند الرد على الهاتف أو عند بدء مكالمة هاتفية. تُترجم إلى \"ألو\" أو \"مرحبًا\" في سياق المكالمات الهاتفية.</p>"
        },
        {
          "grammar_id": "grammar_1_11_2",
          "grammar_title": "2.“在……呢”表示动作正在进行 (“zài……ne” biǎoshì dòngzuò zhèngzài jìnxíng) - \"在……呢\" للدلالة على أن الفعل مستمر",
          "explanation": "<p>للتعبير عن أن الفعل يحدث الآن (مستمر في الحدوث)، يمكن استخدام عدة تراكيب:</p><ul><li>在 + فعل (+ مفعول به) + 呢 (zài + verb (+ object) + ne): \"在\" تأتي قبل الفعل، و\"呢\" تأتي في نهاية الجملة.</li><li>在 + فعل (+ مفعول به) (zài + verb (+ object)): يمكن استخدام \"在\" وحدها قبل الفعل.</li><li>فعل (+ مفعول به) + 呢 (verb (+ object) + ne): يمكن استخدام \"呢\" وحدها في نهاية الجملة.</li><li>正在 + فعل (+ مفعول به) (zhèngzài + verb (+ object)): \"在\" هي الأوضح والأكثر رسمية للدلالة على الاستمرار.</li></ul><p>النفي يكون باستخدام \"没（有）在 + فعل\" (méi (yǒu) zài + verb)، ولا تُستخدم \"呢\" في النفي.</p>"
        },
        {
          "grammar_id": "grammar_1_11_3",
          "grammar_title": "3.电话号码的表达 (diànhuà hàomǎ de biǎodá) - التعبير عن أرقام الهواتف",
          "explanation": "<p>عند قراءة أرقام الهواتف باللغة الصينية:</p><ul><li>تُقرأ الأرقام رقمًا برقم.</li><li>الرقم \"1\" يُقرأ \"yāo\" بدلاً من \"yī\" لتجنب الخلط بينه وبين الرقم \"七\" (qī - سبعة) الذي قد يُسمع بشكل مشابه في بعض اللهجات أو عبر الهاتف.</li></ul>"
        },
        {
          "grammar_id": "grammar_1_11_4",
          "grammar_title": "4.语气助词“吧” (yǔqì zhùcí “ba”) - أداة التلطيف/الاقتراح \"吧\"",
          "explanation": "<p>الأداة \"吧\" (ba) تُستخدم في نهاية الجملة لجعل الأمر أو الاقتراح أو الطلب أكثر لطفًا وتخفيفًا. يمكن أن تُستخدم أيضًا للتعبير عن موافقة مترددة أو افتراض.</p><p>للاقتراح/الأمر المخفف: \"دعنا نفعل كذا، أليس كذلك؟\" أو \"افعل كذا، حسنًا؟\"</p><p>للموافقة/الافتراض: \"حسنًا إذن.\" أو \"أعتقد ذلك.\"</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_12",
      "lesson_title": "الدرس 12",
      "grammar_points": [
        {
          "grammar_id": "grammar_1_12_1",
          "grammar_title": "1.“了”表发生或完成 (“le” biǎo fāshēng huò wánchéng) - \"了\" للدلالة على الحدوث أو الاكتمال",
          "explanation": "<p>هذه هي الوظيفة الثانية للحرف \"了\" (le)، وهي تختلف عن \"了\" في نهاية الجملة للدلالة على التغيير.</p><p>\"了\" بعد الفعل: تُستخدم \"了\" مباشرة بعد الفعل (أو بعد الفعل ومفعوله إذا كان المفعول بسيطًا) للإشارة إلى أن الفعل قد حدث واكتمل.</p><p>\"了\" في نهاية الجملة (مع فعل مكتمل): إذا كان هناك مفعول به أكثر تعقيدًا أو محددًا (مثل \"كتاب واحد\"، \"بعض الملابس\")، غالبًا ما توضع \"了\" بعد الفعل والمفعول به، أو في نهاية الجملة.</p><div class=\"note\"><strong>ملاحظة مهمة:</strong> النفي لجملة تحتوي على \"了\" الدالة على الاكتمال يكون باستخدام \"没（有）\" (méi (yǒu)) قبل الفعل، ويتم حذف \"了\".</div>"
        },
        {
          "grammar_id": "grammar_1_12_2",
          "grammar_title": "2.名词“后” (míngcí “hòu”) - الاسم \"后\" (بعد)",
          "explanation": "<p>الاسم \"后\" (hòu) يُستخدم للإشارة إلى فترة زمنية تلي الوقت الحالي أو وقتًا محددًا تم ذكره. يُترجم إلى \"بعد\". يمكن أن يسبقه مدة زمنية (مثل: 三天后 sāntiān hòu - بعد ثلاثة أيام) أو نقطة زمنية (مثل: 八点后 bā diǎn hòu - بعد الساعة الثامنة).</p>"
        },
        {
          "grammar_id": "grammar_1_12_3",
          "grammar_title": "3.语气助词“啊” (yǔqì zhùcí “a”) - أداة التعجب/التأكيد \"啊\"",
          "explanation": "<p>الأداة \"啊\" (a) تُستخدم في نهاية الجملة الخبرية لإضافة نبرة عاطفية، مثل التعجب، الإعجاب، التأكيد، أو حتى الشكوى الخفيفة. نطق \"啊\" يمكن أن يتغير قليلاً بناءً على الصوت الأخير للكلمة التي تسبقها (يُشار إليه بـ 音变 - yīnbiàn).</p><ul><li>إذا انتهت الكلمة السابقة بـ a, e, i, o, ü، تُنطق \"啊\" كـ \"ya\".</li><li>إذا انتهت الكلمة السابقة بـ u, ao, ou، تُنطق \"啊\" كـ \"wa\".</li><li>إذا انتهت الكلمة السابقة بـ -n، تُنطق \"啊\" كـ \"na\".</li><li>إذا انتهت الكلمة السابقة بـ -ng، تُنطق \"啊\" كـ \"nga\".</li><li>إذا انتهت الكلمة السابقة بـ -i (في المقاطع zi, ci, si)، تُنطق \"啊\" كـ \"za\".</li><li>إذا انتهت الكلمة السابقة بـ -i (في المقاطع zhi, chi, shi, ri)، تُنطق \"啊\" كـ \"ra\".</li></ul><p>هذه التغييرات الصوتية تجعل الكلام أكثر سلاسة. لا تقلق بشأن حفظها كلها الآن؛ ستكتسبها بالسماع والممارسة.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_13",
      "lesson_title": "الدرس 13",
      "grammar_points": [
        {
          "grammar_id": "grammar_1_13_1",
          "grammar_title": "1.“是……的”句：强调时间、地点、方式 (“shì……de” jù: qiángdiào shíjiān, dìdiǎn, fāngshì) - جملة \"是……الـ\" للتأكيد على الوقت، المكان، أو الطريقة",
          "explanation": "<p>التركيبة \"是……の\" (shì...de) تُستخدم للتأكيد على تفاصيل معينة لفعل حدث بالفعل. هذه التفاصيل يمكن أن تكون وقت حدوث الفعل، أو مكانه، أو الطريقة التي تم بها.</p><p>في الجمل الإيجابية والاستفهامية: يمكن حذف \"是\" (shì).</p><p>في الجمل المنفية: لا يمكن حذف \"是\" (shì). النفي يكون \"不是……の\" (bú shì...de).<br>الجزء المؤكد عليه يوضع بين \"是\" و \"の\".</p>"
        },
        {
          "grammar_id": "grammar_1_13_2",
          "grammar_title": "2.日期的表达 (2): 年、月、日/号、星期 (rìqī de biǎodá (2): nián, yuè, rì/hào, xīngqī) - التعبير عن التاريخ (2): السنة، الشهر، اليوم، يوم الأسبوع",
          "explanation": "<p>هذه القاعدة توسع ما تعلمناه سابقًا عن التاريخ لتشمل السنة. الترتيب دائمًا من الأكبر إلى الأصغر:</p><p>السنة (年 nián): تُقرأ الأرقام رقمًا برقم، متبوعة بـ \"年\". مثال: 2023年 (èr líng èr sān nián).</p><p>الشهر (月 yuè): الرقم + 月.</p><p>اليوم (日 rì / 号 hào): الرقم + 日 (رسمي) أو 号 (شفهي).</p><p>يوم الأسبوع (星期 xīngqī): 星期 + الرقم (一 إلى 六)، أو 星期天/日 للأحد.</p>"
        }
      ]
    }
  ]
}
  ],
  "hsk2_lessons": [
    {
      "lesson_id": "lesson_1",
      "lesson_title": "الدرس 1",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_1_1",
          "grammar_title": "1.助动词：要 (zhùdòngcí: yào) - الفعل المساعد \"要\" (الرغبة/النية)",
          "explanation": "<p>الفعل المساعد \"要\" (yào) يُستخدم قبل الفعل الرئيسي للتعبير عن الرغبة أو النية في فعل شيء ما، بمعنى \"يريد أن\" أو \"سيفعل\" (معنى المستقبل القريب بناءً على النية). صيغة النفي لهذه الرغبة هي \"不想\" (bù xiǎng) بمعنى \"لا يريد\".</p>"
        },
        {
          "grammar_id": "grammar_2_1_2",
          "grammar_title": "2.程度副词：最 (chéngdù fùcí: zuì) - ظرف الدرجة \"最\" (الأكثر)",
          "explanation": "<p>الظرف \"最\" (zuì) يُوضع قبل الصفات أو الأفعال (غالبًا الأفعال التي تعبر عن التفضيل مثل \"喜欢 - يحب\") للدلالة على أن شيئًا أو شخصًا ما يتفوق على البقية في جانب معين، بمعنى \"الأكثر\" أو \"الأفضل\" أو \"المفضل لدي\".</p>"
        },
        {
          "grammar_id": "grammar_2_1_3",
          "grammar_title": "3.概数的表达：几、多 (gàishù de biǎodá: jǐ, duō) - التعبير عن الأعداد التقريبية (باستخدام \"几\" و \"多\")",
          "explanation": "<p>تُستخدم \"几\" و \"多\" للإشارة إلى أعداد تقريبية. يختلف استخدامهما وتُغير نغمة الكلمات الكمية في بعض الحالات:</p><p>1.1 “几” للسؤال عن الأعداد الأقل من 10:<br>يُستخدم \"几\" (jǐ) للسؤال عن عدد صغير (عادةً أقل من 10)، ويجب أن يليه كلمة كمية (measure word) ثم الاسم.</p><p>1.2 “几” للإشارة إلى الأعداد بين 10 و 20 أو بين 20 و 100 (تقريبية):</p><p>عندما يأتي \"几\" بعد \"十\" (shí)، فإنه يُشير إلى عدد بين 11 و 19 تقريبًا (أكثر من 10 ولكن ليس بكثير). مثال: 十几 (shíjǐ) - عشرة وبعض/بضعة عشر.</p><p>عندما يأتي \"几\" قبل \"十\" (shí)، فإنه يُشير إلى عدد بين 20 و 90 تقريبًا، بمعنى \"عشرات\". مثال: 几十 (jǐshí) - عشرات/عشرة...</p><p>2.1 “多” للإشارة إلى أعداد تقريبية (الأرقام أقل من 10):<br>عندما يكون العدد الموصوف أقل من 10، يأتي \"多\" (duō) بعد كلمة الكمية.</p><p>2.2 “多” للإشارة إلى أعداد تقريبية (الأرقام 10 وما فوق):<br>عندما يكون العدد 10 أو أكبر (整数 - عدد صحيح)، يأتي \"多\" (duō) قبل كلمة الكمية. في هذه الحالة، يمكن استخدام \"几\" (jǐ) أو \"多\" (duō) بالتبادل.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_2",
      "lesson_title": "الدرس 2",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_2_1",
          "grammar_title": "1.用“是不是”的问句 (yòng “shì bu shì” de wènjù) - الجمل الاستفهامية باستخدام \"是不是\"",
          "explanation": "<p>تُستخدم العبارة \"是不是\" (shì bu shì) في الجمل الاستفهامية عندما يكون المتحدث لديه اعتقاد أو تخمين حول حقيقة أو وضع ما، ويرغب في تأكيد ذلك. تُوضع \"是不是\" عادةً قبل الخبر، أو في بداية الجملة، أو في نهايتها.</p>"
        },
        {
          "grammar_id": "grammar_2_2_2",
          "grammar_title": "2.代词“每” (dàicí “měi”) - الضمير \"每\" (كل / كل واحد)",
          "explanation": "<p>الضمير \"每\" (měi) يُوضع قبل كلمة كمية (measure word) أو قبل كلمات تدل على الزمن مثل \"天 - يوم\" أو \"年 - سنة\"، للإشارة إلى كل فرد أو كل مجموعة في العموم. يُترجم إلى \"كل\" أو \"كل واحد/واحدة\".</p>"
        },
        {
          "grammar_id": "grammar_2_2_3",
          "grammar_title": "3.疑问代词“多” (yíwèn dàicí “duō”) - ضمير الاستفهام \"多\" (للسؤال عن الدرجة/المقياس)",
          "explanation": "<p>الضمير \"多\" (duō) يُستخدم قبل الصفة للسؤال عن درجة أو مدى شيء ما. الإجابة على هذا النوع من الأسئلة تكون عادةً بقياس أو رقم محدد. يُترجم إلى \"كم + (صفة)\" أو \"ما مدى (صفة)\".</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_3",
      "lesson_title": "الدرس 3",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_3_1",
          "grammar_title": "1.“的”字短语 (“de” zì duǎnyǔ) - عبارة \"の\" (بدون اسم صريح)",
          "explanation": "<p>\"的\" (de) يمكن أن تُستخدم مع ضمير أو صفة أو فعل لتشكيل عبارة تعوض عبارة اسمية كاملة حُذف منها الاسم الرئيسي. هي بمثابة \"الشيء الذي\" أو \"ذلك الـ\".</p>"
        },
        {
          "grammar_id": "grammar_2_3_2",
          "grammar_title": "2.一下 (yí xià) - \"لِبرهة / قليلاً\"",
          "explanation": "<p>تُستخدم \"一下\" (yí xià) بعد الفعل مباشرةً للإشارة إلى أن الفعل قد حدث أو سيحدث لوقت قصير، أو أن يكون عملًا مؤقتًا أو تجريبيًا. يُترجم إلى \"قليلاً\" أو \"برهة\" أو \"سريعة\". يمكن أن يُحذف المفعول به في هذه الحالة.</p>"
        },
        {
          "grammar_id": "grammar_2_3_3",
          "grammar_title": "3.语气副词“真” (yǔqì fùcí “zhēn”) - ظرف الشدة \"真\" (حقًا)",
          "explanation": "<p>الظرف \"真\" (zhēn) يُوضع قبل الصفة للتعبير عن الدهشة أو التعجب أو التأكيد على حقيقة الأمر. يُترجم إلى \"حقًا\" أو \"بصدق\" أو \"ياللـ\".</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_4",
      "lesson_title": "الدرس 4",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_4_1",
          "grammar_title": "1.“是……的”句：强调施事 (“shì……de” jù: qiángdiào shīshì) - جملة \"是……の\" (للتأكيد على الفاعل)",
          "explanation": "<p>تُستخدم التركيبة \"是……的\" (shì...de) عندما يكون الحدث قد وقع بالفعل، وتهدف إلى التأكيد على من قام بالفعل، أو تحديد الفاعل. في الجمل المنفية، تُستخدم \"不是\" (bú shì) ولا تُحذف \"是\".</p>"
        },
        {
          "grammar_id": "grammar_2_4_2",
          "grammar_title": "2.表示时间：……的时候 (biǎoshì shíjiān: “……de shíhou”) - التعبير عن الوقت: \"……في الوقت الذي\"",
          "explanation": "<p>تُستخدم عبارة \"……的时候\" (……de shíhou) للإشارة إلى نقطة زمنية محددة أو فترة زمنية:</p><p>2.1 (عدد + كلمة كمية زمنية) + 的时候: تشير إلى فترة زمنية محددة، مثل الساعة الثامنة، في العمر الثامنة عشر.</p><p>2.2 فعل + 的时候: تُستخدم عندما يرتبط الوقت بحدوث فعل معين.</p>"
        },
        {
          "grammar_id": "grammar_2_4_3",
          "grammar_title": "3.时间副词“已经” (shíjiān fùcí “yǐjīng”) - ظرف الزمن \"已经\" (بالفعل)",
          "explanation": "<p>الظرف \"已经\" (yǐjīng) يُوضع قبل الفعل للدلالة على أن الفعل قد اكتمل أو أن الموقف وصل إلى درجة معينة \"بالفعل\" أو \"قد حدث بالفعل\".</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_5",
      "lesson_title": "الدرس 5",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_5_1",
          "grammar_title": "1.副词“就” (fùcí “jiù”) - الظرف \"就\" (ثم/بالتالي)",
          "explanation": "<p>الظرف \"就\" (jiù) يُوضع قبل الفعل للدلالة على نتيجة أو استنتاج تم التوصل إليه بناءً على ما ذُكر سابقًا. بمعنى \"إذا (حدث كذا)، فـ (يحدث كذا)\". قد يعبر عن سهولة، سرعة، أو حتمية.</p>"
        },
        {
          "grammar_id": "grammar_2_5_2",
          "grammar_title": "2.语气副词“还”(1) (yǔqì fùcí “hái” (1)) - الظرف الحواري \"还\" (1) (مقبول/لا بأس به)",
          "explanation": "<p>الظرف \"还\" (hái) يُوضع قبل الصفة للدلالة على أن الحالة \"مقبولة\"، \"ليست سيئة للغاية\"، أو \"لا بأس بها\". تُستخدم للإجابة بشكل معتدل أو للإشارة إلى درجة متوسطة ليست ممتازة ولكنها ليست سيئة.</p>"
        },
        {
          "grammar_id": "grammar_2_5_3",
          "grammar_title": "3.程度副词“有点儿” (chéngdù fùcí “yǒudiǎnr”) - ظرف الدرجة \"有点儿\" (قليلاً - مع سلبية)",
          "explanation": "<p>الظرف \"有点儿\" (yǒudiǎnr) يُوضع قبل الصفة أو الفعل للتعبير عن قدر قليل من الصفة أو الشعور، وعادة ما يُشير إلى شعور سلبي، شكوى، أو عدم رضا. يُترجم إلى \"قليلاً ما / نوعًا ما\".</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_6",
      "lesson_title": "الدرس 6",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_6_1",
          "grammar_title": "1.疑问代词“怎么” (yíwèn dàicí “zěnme”) - ضمير الاستفهام \"怎么\" (لماذا/كيف حدث - للدلالة على المفاجأة/السبب)",
          "explanation": "<p>هذه الوظيفة لـ \"怎么\" (zěnme) تُستخدم قبل الفعل أو الصفة للسؤال عن سبب شيء ما أو للتعبير عن المفاجأة والدهشة حيال حدث معين. تختلف عن \"怎么\" السابقة التي تسأل عن طريقة فعل شيء.</p>"
        },
        {
          "grammar_id": "grammar_2_6_2",
          "grammar_title": "2.量词的重叠 (liàngcí de chóngdié) - تكرار كلمات الكمية",
          "explanation": "<p>عندما تُكرر كلمة كمية (مثال: 个个 gègè، 件件 jiànjiàn)، فإنها تُعبّر عن \"كل\" أو \"كل واحد/واحدة\" ضمن مجموعة، وتؤكد أن الميزة المذكورة تنطبق على جميع أفراد تلك المجموعة. غالبًا ما يتبع هذا التكرار الظرف \"都\" (dōu) بمعنى \"جميعًا\" أو \"كلهم\".</p>"
        },
        {
          "grammar_id": "grammar_2_6_3",
          "grammar_title": "3.关联词“因为……,所以……” (guānliáncí “yīnwèi……, suǒyǐ……”) - أداتا الربط \"لأن……، لذلك……\"",
          "explanation": "<p>\"لأن……، لذلك……\" (yīnwèi……, suǒyǐ……) هما أداتا ربط تُستخدمان لربط جملتين بحيث تُقدم الجملة الأولى السبب (\"لأن\")، والجملة الثانية تُقدم النتيجة (\"لذلك\"). يمكن استخدام الأداتين معًا أو إحداهما فقط، اعتمادًا على وضوح السياق.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_7",
      "lesson_title": "الدرس 7",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_7_1",
          "grammar_title": "1.语气副词“还”(2) (yǔqì fùcí “hái” (2)) - الظرف الحواري \"还\" (2) (للدلالة على الاستمرارية)",
          "explanation": "<p>تُستخدم \"还\" (hái) قبل الفعل للدلالة على استمرار فعل أو حالة. هذا الاستخدام يشير إلى أن الفعل لم يتوقف أو لم ينته بعد، أو أن الحالة مستمرة. غالبًا ما يُستخدم هذا \"还\" في الأسئلة أو لبيان أن شيئًا ما لا يزال جاريًا أو لم يكتمل بعد. النفي يكون بـ \"لم (يعد) في\" (hái méi(yǒu)) بمعنى \"لم ... بعد\".</p>"
        },
        {
          "grammar_id": "grammar_2_7_2",
          "grammar_title": "2.时间副词“就” (shíjiān fùcí “jiù”) - الظرف الزمني \"就\" (مبكراً/بسرعة/في الحال)",
          "explanation": "<p>يُوضع الظرف \"就\" (jiù) قبل الفعل للدلالة على أن الفعل حدث مبكرًا أو بسرعة أو بسهولة أكبر مما هو متوقع، أو للتعبير عن السرعة. تُضاف \"了\" (le) غالبًا في نهاية الجملة.</p>"
        },
        {
          "grammar_id": "grammar_2_7_3",
          "grammar_title": "3.离 (lí) - الفعل \"离\" (مسافة/يبعد عن)",
          "explanation": "<p>الفعل \"离\" (lí) يُستخدم للإشارة إلى المسافة (الفيزيائية أو الزمنية) بين مكانين أو وقتين أو أهداف. التركيبة تكون: \"مكان A / وقت A + 在 + مكان B / وقت B (+ صفة للمسافة)\".</p>"
        },
        {
          "grammar_id": "grammar_2_7_4",
          "grammar_title": "4.语气助词“呢” (yǔqì zhùcí “ne”) - أداة تلطيف التأكيد \"呢\" (التوكيد/الاستطراد)",
          "explanation": "<p>بالإضافة إلى استخداماتها السابقة، يمكن استخدام \"呢\" (ne) في نهاية الجملة الخبرية (خاصة تلك التي يكون الخبر فيها صفة أو فعل) للتأكيد على حقيقة معينة، أو إقناع الطرف الآخر بها، أو للإشارة إلى أن الشيء واضح أو بديهي. يمكن أن تحمل نبرة توكيد مبالغ فيها أو حيرة أحيانًا.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_8",
      "lesson_title": "الدرس 8",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_8_1",
          "grammar_title": "1.疑问句“……，好吗” (yíwèn jù “……, hǎo ma”) - الجملة الاستفهامية \"……،好吗\" (هل هذا جيد/ما رأيك؟)",
          "explanation": "<p>التركيبة \"……،好吗؟\" (……, hǎo ma?) تُستخدم في نهاية الجملة لطرح سؤال عن رأي الآخرين أو للحصول على موافقتهم على اقتراح. تُترجم غالبًا إلى \"……، أليس كذلك؟\" أو \"……، ما رأيك؟\" أو \"……، حسنًا؟\".</p>"
        },
        {
          "grammar_id": "grammar_2_8_2",
          "grammar_title": "2.副词“再” (fùcí “zài”) - الظرف \"再\" (مرة أخرى/ثم)",
          "explanation": "<p>الظرف \"再\" (zài) يُستخدم:</p><ul><li>للدلالة على تكرار أو استمرارية فعل أو حالة لم تحدث بعد (عادة في المستقبل)، بمعنى \"مرة أخرى\" أو \"إضافة إلى ذلك\".</li><li>يمكن أن يُستخدم أيضًا للدلالة على أن الفعل سيحدث بعد تحقق شرط معين، بمعنى \"ثم\" أو \"بعد ذلك\".</li></ul>"
        },
        {
          "grammar_id": "grammar_2_8_3",
          "grammar_title": "3.兼语句 (jiēnjù) - الجمل المحورية (Pivotal Sentences)",
          "explanation": "<p>الجمل المحورية هي جمل يتكون الخبر فيها من عبارتين فعليتين. المميز في هذه الجملة أن المفعول به للفعل الأول هو نفسه فاعل الفعل الثاني. الأفعال الأكثر شيوعًا في هذا النوع هي \"请\" (qǐng - يدعو/يطلب)، \"让\" (ràng - يسمح/يجعل)، و \"叫\" (jiào - يطلب/يجعل).</p><p>التركيبة: الفاعل (للفعل الأول) + الفعل الأول + المفعول به (والذي هو فاعل الفعل الثاني) + الفعل الثاني (+ المفعول به).</p>"
        },
        {
          "grammar_id": "grammar_2_8_4",
          "grammar_title": "4.动词的重叠 (dòngcí de chóngdié) - تكرار الأفعال",
          "explanation": "<p>تُستخدم الأفعال المكررة (عادة فعل monosyllabic بصيغة AA مثل 看看 kànkan، أو فعل disyllabic بصيغة ABAB مثل 学习学习 xuéxí xuéxí) للتعبير عن:</p><ul><li>فعل قصير المدى أو يُؤدى لوقت قصير.</li><li>تجربة خفيفة أو محاولة.</li><li>لهجة غير رسمية أو مريحة، مع نبرة لطيفة أو \"فعل قليلاً\".</li></ul>"
        }
      ]
    },
    {
      "lesson_id": "lesson_9",
      "lesson_title": "الدرس 9",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_9_1",
          "grammar_title": "1.结果补语 (jiéguǒ bǔyǔ) - تكملة النتيجة (Complements of Result)",
          "explanation": "<p>تُستخدم \"تكملة النتيجة\" (فعل أو صفة) بعد الفعل الرئيسي لتوضح نتيجة الفعل أو تحقيق هدف معين. الأفعال الأكثر شيوعًا كـ \"مُكمل نتيجة\" هي \"见 - يرى\" (مع 看 - kàn: 看见 - يرى بوضوح)، \"懂 - يفهم\" (مع 听 - tīng: 听懂 - يفهم بالاستماع)، \"好 - جيد\" (مع 做 - zuò: 做好 - يُنهي بشكل جيد).</p><div class=\"note\"><strong>ملاحظات هامة:</strong><br><br>إذا كان للفعل مفعول به، فيجب أن يُكرر الفعل بعد المفعول به، أو يُوضع المفعول به قبل الفعل.<br><br>التركيبة الأولى: فاعل + (مفعول به +) فعل + (فعل) + 得 + تكملة الحالة. (مثال: هو يتحدث الصينية جيداً جداً / هو يتحدث الصينية جيداً جداً)<br><br>التركيبة الثانية (إذا وُضعت \"الـ\" بعد الفعل لتشكل الاسم، فهذا تعبير مختلف):<br>فاعل + الفعل + 在 + تكملة الحالة. (مع إمكانية وضع المفعول به قبل الفعل، أو تكرار الفعل)<br><br>النفي: يُوضع النفي \"لا\" (لا) بعد \"在\" مباشرةً.<br><br>السؤال (سؤال إيجابي-سلبي): يكون بصيغة (تكملة الحالة) + لا + (تكملة الحالة) بعد \"在\".</div>"
        },
        {
          "grammar_id": "grammar_2_9_2",
          "grammar_title": "2.介词“从” (jiècí “cóng”) - حرف الجر \"从\" (من)",
          "explanation": "<p>حرف الجر \"从\" (cóng) يُستخدم للدلالة على نقطة البداية لـ:</p><ul><li>الوقت: (من + وقت).</li><li>المكان: (من + مكان).</li><li>التسلسل: (من + شيء إلى + شيء).<br>غالبًا ما يُستخدم \"من\" مع \"إلى\" (dào - إلى) في التركيبة \"من أ إلى ب\".</li></ul>"
        },
        {
          "grammar_id": "grammar_2_9_3",
          "grammar_title": "3.“第~”表示顺序 (“dì~” biǎoshì shùnxù) - \"第~\" للدلالة على الترتيب",
          "explanation": "<p>تُستخدم \"第\" (dì) قبل الأرقام وكلمات الكمية للدلالة على الترتيب أو الترتيب العددي (الأول، الثاني، الثالث، وهكذا).</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_10",
      "lesson_title": "الدرس 10",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_10_1",
          "grammar_title": "1.祈使句：不要……了；别……了 (qǐshǐjù: bú yào...le; bié...le) - الجمل الأمرية: \"لا تفعل...؛ لا تفعل...\" (للمنع/التثبيط)",
          "explanation": "<p>هذه التركيبات تُستخدم للتحذير أو النصح أو منع شخص من فعل شيء معين. كلاهما يعبر عن المنع أو النهي، و\"了\" (le) تُستخدم في النهاية لتأكيد التحذير أو الدلالة على أن الحالة قد بدأت أو على وشك البدء وتجنب استمرارها.</p><p>لا تفعل ذلك بعد الآن (bú yào...le): صيغة نهي عامة، \"لا تفعل ذلك بعد الآن\" أو \"يجب ألا تفعل هذا\".</p><p>لا تفعل (bié...le): غالبًا ما تكون أقوى وأكثر حذرًا، بمعنى \"لا تفعل! كفى\". تُستخدم للنهي المباشر.</p>"
        },
        {
          "grammar_id": "grammar_2_10_2",
          "grammar_title": "2.介词“对” (jiècí “duì”) - حرف الجر \"对\" (تجاه/إلى/صالح)",
          "explanation": "<p>حرف الجر \"对\" (duì) يُستخدم للدلالة على العلاقة المستهدفة (الشخص، الشيء، الحالة) التي يرتبط بها فعل أو صفة. بمعنى \"تجاه\"، \"إلى\"، \"بشأن\"، أو \"صالح\".</p><p>التركيبة: (فاعل) + إلى + (المستهدف) + فعل/صفة/جملة.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_11",
      "lesson_title": "الدرس 11",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_11_1",
          "grammar_title": "1.动词结构做定语 (dòngcí jiégòu zuò dìngyǔ) - التركيبة الفعلية كصفة (Attributive Modifier)",
          "explanation": "<p>عندما تُستخدم عبارة فعلية أو فعل كصفة لوصف اسم آخر (الكلمة المركزية)، فيجب أن تُوضع \"الـ\" (de) بين التركيبة الفعلية (الموصوف بها) والاسم الذي تُوصفه (الكلمة المركزية). التركيبة: (فعل/عبارة فعلية + الـ) + الاسم.</p>"
        },
        {
          "grammar_id": "grammar_2_11_2",
          "grammar_title": "2.“比”字句(1) (“bǐ” zì jù (1)) - جملة المقارنة \"比\" (1)",
          "explanation": "<p>تُستخدم أداة المقارنة \"比\" (bǐ) لمقارنة شيئين أو شخصين من حيث الصفة.<br>التركيبة الأساسية: أ + من + ب + (صفة).</p><div class=\"note\"><strong>ملاحظات إضافية حول المقارنة لتحديد الفارق:</strong><br>عند تحديد الفرق بكمية معينة أو درجة، تُوضع الكمية بعد الصفة:<br><br>أ + من + ب + (صفة) + (كمية/فرق).<br>مثال: أنا أكبر منك بسنتين. أنا أكبر منك بسنتين. (أنا أكبر منك بسنتين.)<br><br>قليلاً / بعض الشيء (yìdiǎnr)/بعض الشيء (yìxiē): قليلاً / بعض الشيء. للدلالة على فرق بسيط.<br>مثال: اليوم أدفأ قليلاً من أمس. اليوم أدفأ قليلاً من أمس. (اليوم أدفأ قليلاً من أمس.) (دافئ دافئ: دافئ)<br><br>كثير (duō)/كثير (de de duō): كثير / أكثر بكثير. للدلالة على فرق كبير.<br>مثال: هي أجمل مني بكثير. هي أجمل مني بكثير. (هي أجمل مني بكثير.) (جميل جميل: جميل)</div>"
        },
        {
          "grammar_id": "grammar_2_11_3",
          "grammar_title": "3.助动词“可能” (zhùdòngcí “kěnéng”) - الفعل المساعد \"可能\" (ربما/محتمل)",
          "explanation": "<p>الفعل المساعد \"可能\" (kěnéng) يُوضع قبل الفعل (أو قبل الفاعل أيضًا) للتعبير عن احتمال أو تقدير حدوث شيء. يُترجم إلى \"ربما\" أو \"من المحتمل أن\".</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_12",
      "lesson_title": "الدرس 12",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_12_1",
          "grammar_title": "1.状态补语 (zhuàngtài bǔyǔ) - تكملة الحالة (Complements of State)",
          "explanation": "<p>تُستخدم \"تكملة الحالة\" لوصف أو تقييم مدى أو حالة الفعل. يتم ربط الفعل وتكملة الحالة بـ \"在\" (de).</p><div class=\"note\"><strong>ملاحظات هامة:</strong><br><br>إذا كان للفعل مفعول به، فيجب أن يُكرر الفعل بعد المفعول به، أو يُوضع المفعول به قبل الفعل.<br><br>التركيبة الأولى: فاعل + (مفعول به +) فعل + (فعل) + في + تكملة الحالة. (مثال: هو يتحدث الصينية جيداً جداً / هو يتحدث الصينية جيداً جداً)<br><br>التركيبة الثانية (إذا وُضعت \"الـ\" بعد الفعل لتشكل الاسم، فهذا تعبير مختلف):<br>فاعل + الفعل + في + تكملة الحالة. (مع إمكانية وضع المفعول به قبل الفعل، أو تكرار الفعل)<br><br>النفي: يُوضع النفي \"لا\" (لا) بعد \"في\" مباشرةً.<br><br>السؤال (سؤال إيجابي-سلبي): يكون بصيغة (تكملة الحالة) + لا + (تكملة الحالة) بعد \"في\".</div>"
        },
        {
          "grammar_id": "grammar_2_12_2",
          "grammar_title": "2.“比”字句(2) (“bǐ” zì jù (2)) - جملة المقارنة \"比\" (2) (مع تكملة حالة)",
          "explanation": "<p>عند مقارنة أداء شخصين أو شيئين في فعل معين (حيث يتم وصف الأداء بتكملة حالة)، تُوضع \"比\" (bǐ) بعد الفعل وتكملة الحالة (الفعل +在 + تكملة الحالة + من + المفعول به + تكملة الحالة).</p><p>التركيبة: الفاعل أ + الفعل + 在 + تكملة الحالة (+ من + الفاعل ب + تكملة الحالة/الرقمية).<br>أبسط للتعلم: أ + (فعل + في) + تكملة الحالة (خاصة بـ أ) + ب + (فعل + في) + تكملة الحالة (خاصة بـ ب).<br>أو الأكثر شيوعًا وبساطة في هذا المستوى: أ + (فعل + في) + صفة + من + ب + (صفة).</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_13",
      "lesson_title": "الدرس 13",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_13_1",
          "grammar_title": "1.动态助词“着” (dòngtài zhùcí “zhe”) - الأداة الشكلية \"着\" (الدلالة على استمرارية الحالة/الفعل)",
          "explanation": "<p>تُستخدم \"着\" (zhe) بعد الفعل للدلالة على أن الفعل أو حالة الفعل مستمرة أو باقية. هذا يعني أن الحركة (الفعل) قد انتهت، ولكن نتيجتها أو حالتها ما زالت قائمة.</p><p>النفي: يُوضع \"لا\" (لا) قبل الفعل (أيضًا مع عدم استخدام \"着\").<br>السؤال: يُضاف \"لا يوجد؟\" (لا يوجد؟) في نهاية الجملة.</p>"
        },
        {
          "grammar_id": "grammar_2_13_2",
          "grammar_title": "2.反问句“不是……吗” (fǎnwènjù “bú shì……ma”) - السؤال البلاغي \"أليس كذلك؟\"",
          "explanation": "<p>تُستخدم التركيبة \"ليس كذلك؟\" (ليس كذلك؟) لتقديم سؤال بلاغي يهدف إلى:</p><ul><li>تذكير شخص ما بشيء واضح أو متفق عليه.</li><li>التعبير عن الارتباك أو عدم الرضا.<br>الهدف ليس الحصول على معلومة جديدة، بل تأكيد أو التعبير عن موقف.</li></ul>"
        },
        {
          "grammar_id": "grammar_2_13_3",
          "grammar_title": "3.介词“往” (jiècí “wǎng”) - حرف الجر \"往\" (باتجاه)",
          "explanation": "<p>حرف الجر \"往\" (wǎng) يُوضع قبل كلمة تدل على اتجاه أو مكان لتوضيح الاتجاه الذي يتجه نحوه الفعل. يُترجم إلى \"باتجاه\" أو \"نحو\". غالبًا ما يُستخدم مع أفعال الحركة مثل \"اذهب - يمشي\"، \"انظر - ينظر\"، \"اطير - يطير\".</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_14",
      "lesson_title": "الدرس 14",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_14_1",
          "grammar_title": "1.动态助词“过” (dòngtài zhùcí “guò”) - الأداة الشكلية \"过\" (الدلالة على تجربة سابقة)",
          "explanation": "<p>تُستخدم الأداة الشكلية \"过\" (guò) بعد الفعل للدلالة على أن الفعل قد حدث أو حدث في الماضي كتجربة، ولكنه لا يمتد حتى الوقت الحاضر. التركيز على \"التجربة\".</p><div class=\"note\"><strong>ملاحظات هامة:</strong><br><br>النفي: \"لا يوجد (فعل) على الإطلاق\" (لا يوجد (فعل) على الإطلاق)<br><br>السؤال: \"فعل + على الإطلاق + (مفعول به) + لا يوجد؟\" أو \"ماذا؟\"</div>"
        },
        {
          "grammar_id": "grammar_2_14_2",
          "grammar_title": "2.关联词“虽然……，但是……” (guānliáncí “suīrán……, dànshì……”) - أداتا الربط \"على الرغم من……، إلا أن……\"",
          "explanation": "<p>تُستخدم أداتا الربط \"على الرغم من……، إلا أن……\" (على الرغم من……، إلا أن……) لربط جملتين تعبران عن علاقة تناقض أو تضاد. \"على الرغم من\" تُوضع قبل الجملة التي تحتوي على تنازل أو حقيقة مُعترف بها، و \"لكن\" تُقدم الجملة التي تحتوي على التضاد أو المفاجأة. يمكن استخدام كلاهما معًا أو إحداهما فقط، اعتمادًا على وضوح السياق.</p>"
        },
        {
          "grammar_id": "grammar_2_14_3",
          "grammar_title": "3.动量补语“次” (dòngliàng bǔyǔ “cì”) - تكملة التكرار \"次\" (مرات)",
          "explanation": "<p>تُستخدم \"مرتين\" (cì) بعد الفعل مباشرة (أو بعد المفعول به في حالات معينة) للإشارة إلى عدد مرات حدوث الفعل. بمعنى \"مرة / مرات\".<br>التركيبة: (فعل) + (رقم) + مرات + (مفعول به).<br>ملاحظة: إذا كان المفعول به يشير إلى مكان، يمكن أن تُوضع \"رقم + مرات\" قبل أو بعد المكان. إذا كان المفعول به ضميرًا شخصيًا، فيجب أن تُوضع \"رقم + مرات\" بعد الضمير.</p>"
        }
      ]
    },
    {
      "lesson_id": "lesson_15",
      "lesson_title": "الدرس 15",
      "grammar_points": [
        {
          "grammar_id": "grammar_2_15_1",
          "grammar_title": "1.动作的状态“要……了” (dòngzuò de zhuàngtài “yào...le”) - \"即将 يحدث\" (الدلالة على قرب الحدوث)",
          "explanation": "<p>التركيبة \"على وشك أن……\" (على وشك أن……) تُستخدم للإشارة إلى أن فعلًا ما أو حالة ما ستحدث في المستقبل القريب جدًا، بمعنى \"على وشك أن\" أو \"سـ... قريباً\". يمكن أيضًا استخدام \"على وشك أن……\" (على وشك أن……)، \"قريبًا……\" (قريبًا……)، أو \"على وشك أن……\" (على وشك أن……) لنفس المعنى، مع وجود فروق بسيطة في التأكيد على مدى القرب.</p><p>\"على وشك أن……\" تُستخدم بشكل إلزامي عندما يوجد ظرف زمني يحدد وقت حدوث الفعل (مثل \"الشهر القادم\" - الشهر القادم).</p>"
        },
        {
          "grammar_id": "grammar_2_15_2",
          "grammar_title": "2.“都……了” (dōu...le) - \"بالفعل\" (للدلالة على الانتهاء مع توكيد/شكوى)",
          "explanation": "<p>تُستخدم التركيبة \"كل……، انتهى\" (كل……، انتهى) في نهاية الجملة للدلالة على أن فعلًا قد اكتمل أو وصل إلى نقطة معينة \"بالفعل\"، وعادة ما تحمل نبرة توكيد، دهشة، نقد، أو شكوى، وغالبًا ما تشير إلى أن الوقت قد تأخر أو تجاوز الحد المعقول.</p>"
        }
      ]
    }
  ]
}
